using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Collections
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
1.	Создать коллекцию List <int> . 
Вывести на экран позицию и значение элемента, являющегося вторым максимальным значением в коллекции. 
Вывести на экран сумму элементов на четных позичиях.

2.	Удалить все нечетные элементы списка List<int>

3.	Дана коллекция типа List<double>. Вывести на экран элементы списка, 
значение которых больше среднего арифметического всех элементов коллекции.

4.	Напечатать содержимое текстового файла t, выписывая литеры каждой его строки в обратном порядке.

5.	Даны 2 строки s1 и s2. Из каждой можно читать по одному символу. 
Выяснить, является ли строка s2 обратной s1.

6.	Дан текстовый файл. За один просмотр файла напечатать элементы файла в следующем порядке:
сначала все слова, начинающиеся на гласную букву, 
потом все слова, начинающиеся на согласную букву, сохраняя исходный порядок в каждой группе слов.

7.	Дан файл, содержащий числа. За один просмотр файла напечатать элементы файла в следующем порядке: 
сначала все положительные числа, 
потом все отрицательные числа, сохраняя исходный порядок в каждой группе чисел.

8.	Удалить все нечетные элементы списка List<int>

9.	Дана коллекция типа List<double>. Вывести на экран элементы списка, 
значение которых больше среднего арифметического всех элементов коллекции.

*/
        }
    }
}
